lisir233/ESP-Iris/components/esp_iris/examples/media_streams/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# High-speed CDC0 belongs exclusively to ESP-Iris. The Serial/JTAG interface
# remains available for flashing and the normal ESP-IDF console.
CONFIG_ESP_IRIS_TRANSPORT_USB=y
CONFIG_ESP_IRIS_MEDIA_LATEST_BYTES=3840
CONFIG_TINYUSB_CDC_RX_BUFSIZE=8192
CONFIG_TINYUSB_CDC_TX_BUFSIZE=8192
CONFIG_TINYUSB_CDC_EP_BUFSIZE=8192
